# -*- coding: UTF-8 -*-

# 企业发放的奖金根据利润提成:
# 利润(I)低于或等于10万元时，奖金可提10%;
# 利润高于10万元，低于20万元时，低于10万元的部分按10%提成,高于10万元的部分，可提成7.5%;
# 20万到40万之间时，高于20万元的部分，可提成5%,
# 40万到60万之间时高于40万元的部分，可提成3%;
# 60万到100万之间时，高于60万元的部分，可提成1.5%;
# 高于100万元时，超过100万元的部分按1%提成;
# 从键盘输入当月利润I，求应发放奖金总数.

I = int(input("Enter account:"))
bonus = 0;

if I <= 100000:
	bonus = I * 100 / 1000
elif I <= 200000:
	bonus = 100000 * 100 / 1000 + (I - 100000) * 75 / 1000
elif I <= 400000:
	bonus = 100000 * 100 / 1000 + 100000 * 75 / 1000 + (I - 200000) * 50 / 1000
elif I <= 600000:
	bonus = 100000 * 100 / 1000 + 100000 * 75 / 1000 + 200000 * 50 / 1000 + (I - 400000) * 30 / 1000
elif I <= 1000000:
	bonus = 100000 * 100 / 1000 + 100000 * 75 / 1000 + 200000 * 50 / 1000 + 200000 * 30 / 1000 + (I - 600000) * 15 / 1000
else:
	bonus = 100000 * 100 / 1000 + 100000 * 75 / 1000 + 200000 * 50 / 1000 + 200000 * 30 / 1000 + 400000 * 15 / 1000 + (I - 1000000) * 10 / 1000

print("When account is ", I, "the bonus is ", bonus)